[{"id": "a08c20", "title": "MASTER Kathleen's Game-Knights Deck in UNDER 10 MINUTES", "date": "2023-06-11", "image": null, "text": "<p>Today we start a small miniseries where I explore the 4 decks that were played on the last episode of Game-Knights. We start with Kathleen De Vere's Slimefoot and Squee deck which is a Jund reanimator deck, where I have added a couple of infinite combo possibilities. I hope you enjoy this series!</p>\n", "video": "https://www.youtube.com/embed/8wHiSOEVT4k", "likes": 1, "author": "brazorobot"}, {"id": "10a2e0", "title": "Jimmy's Deck is the Atraxa Killer??? BRILLIANT Tech!!!", "date": "2023-06-11", "image": null, "text": "<p>This is part 2 of my mini series dedicated to building the Game-Knights decks in Historic Brawl and it is time for Jimmy Wong's Goro-Goro and Satoru deck. This Commander is a 3 mana 3/4 goblin human that has: \"whenever one or more creatures you control that entered de battlefield this turn deal combat damage to a player, create a 5/5 dragon spirit token with flying\" and then, we can pay 2 to give haste to our creatures!</p>\n", "video": "https://www.youtube.com/embed/9RIOsqnZjAA", "likes": 1, "author": "brazorobot"}, {"id": "ab75fa", "title": "A Better Colossal Dreadmaw in your Command Zone??? CRAZYNESS!!!", "date": "2023-06-11", "image": null, "text": "<p>Today is part 3 of my mini-series dedicated to playing with the commanders from the last episode of Game-Knights. This time it's the turn for Graham's Surrak and Goreclaw bear deck! This deck is janky but if you draw well enough it can become really really powerful.</p>\n", "video": "https://www.youtube.com/embed/_FWvK2daaP8", "likes": 1, "author": "brazorobot"}, {"id": "739c88", "title": "WOOOOW!!! Is this the Best Reanimation Commander in the Format???", "date": "2023-06-11", "image": null, "text": "<p>Today we are playing with the last deck from last episode of Game-Knights. This is the deck that was played by Josh Lee-Kwai and it's Rona's dimir reanimator. The idea is to use her to loot, discarding our threats to the graveyard only to reanimate them and cheat big threats into play very early in the game. </p>\n", "video": "https://www.youtube.com/embed/TK3GozviXTo", "likes": 1, "author": "brazorobot"}, {"id": "bb408a", "title": "1 Mana White Spells but each card GETS BETTER AND BETTER", "date": "2023-06-11", "image": null, "text": "<p>Today I'm doing a review of the best 1 mana value spells in white for the format. These are cards you have to consider when building your deck.</p>\n", "video": "https://www.youtube.com/embed/ZyAJ0VhIMyc", "likes": 1, "author": "brazorobot"}, {"id": "977d71", "title": "Now THIS is a FUN card!!! 😂", "date": "2023-06-11", "image": "https://cards.scryfall.io/normal/front/7/f/7f93ad17-b655-4a10-990e-b26ead90d221.jpg?1686339146", "text": "<p>OMG I want to play with this as my commander so bad!</p>\n\n<p>I think it is actually really good... 2 mana for a ~50% chance of drawing a card?</p>\n\n<p>It also won't die in combat easily... If opponent guesses right, it's removed from combat.</p>\n\n<p>If they guess wrong, it's unblocable.</p>\n\n<p>What an interesting and flavorful card!</p>\n\n<p>Please less Atraxas and more of THIS</p>\n", "video": null, "likes": 1, "author": "brazorobot"}]
