[{"title": "prueba", "date": "2023-06-01", "image": "https://cards.scryfall.io/normal/front/3/8/384ec8b7-472e-4026-9632-349ab9df2b27.jpg?1674134960", "text": "esto es una prueba"}, {"title": "First blog post", "date": "2023-05-31", "text": "Welcome to the ever-expanding universe of Magic: The Gathering, the world's premier trading card game. In this intricate universe, you take on the role of a powerful Planeswalker, summoning colossal beasts, casting potent spells, and outwitting opponents in a dynamic game of strategy. Each match transports you to vibrant planes of existence, each teeming with unique creatures, spells, and enchantments. Magic isn't just a game; it's an immersive, constantly evolving adventure that challenges the mind and sparks the imagination. Whether you're a veteran player, a collector of stunning art cards, or a newcomer just starting your journey, the MTG multiverse always has something new and exciting to offer. So, shuffle your deck, draw your starting hand, and step into the infinite possibilities of Magic: The Gathering."}, {"title": "Second blog post", "date": "2023-06-01", "video": "https://www.youtube.com/embed/DxFHOQKEUUM", "text": "This is the text for the second blog post..."}, {"title": "otra prueba", "date": "hoy", "image": null, "text": "Magic: The Gathering is a captivating and immersive trading card game that has enchanted players around the world for decades. Created by mathematics professor Richard Garfield and first published in 1993, it has since become a cultural phenomenon, blending strategy, fantasy, and creativity into a remarkable gameplay experience.  In the vast and intricate world of Magic, players take on the role of powerful mages known as Planeswalkers. Through the use of spell-casting cards, they summon creatures, artifacts, and enchantments to battle against opponents. Each Planeswalker possesses a unique set of abilities, aligning them with one of five colorful mana types: white, blue, black, red, or green. These mana colors represent different aspects of magic, such as order, knowledge, death, chaos, and nature.  What sets Magic: The Gathering apart from other games is its expansive multiverse. The game takes place across countless planes of existence, each with its own distinct themes, characters, and lore. From the gothic horror of Innistrad to the high-fantasy world of Dominaria, the possibilities for adventure are limitless. Players can explore rich narratives through various card sets, where the story unfolds and evolves with every expansion.  With over 20,000 unique cards in circulation, Magic: The Gathering offers an abundance of strategic choices and deck-building possibilities. Whether constructing a rampaging horde of goblins, mastering ancient spells, or controlling the flow of time itself, players can create personalized decks that reflect their preferred playstyle. The game encourages resource management, tactical decision-making, and adaptability, making each match a dynamic and thrilling contest of wits.  Magic also fosters a vibrant and inclusive community. From casual kitchen-table gatherings to fiercely competitive tournaments, players come together to share their love for the game, exchange strategies, and forge lasting friendships. The game's social aspect extends beyond the tabletop, with online platforms and digital adaptations allowing players to connect and compete from around the globe.  Through its ever-expanding universe, strategic depth, and passionate community, Magic: The Gathering continues to capture the hearts and minds of players, ensuring that the spellbinding legacy of this extraordinary game endures for years to come.", "video": "https://www.youtube.com/embed/m0RJJYGirbA"}, {"title": "111111", "date": "1111", "image": "asasa", "text": "1", "video": null}]