[{"id": "a08c20", "site": "magic", "title": "MASTER Kathleen's Game-Knights Deck in UNDER 10 MINUTES", "date": "2023-06-11", "image": null, "text": "<p>Today we start a small miniseries where I explore the 4 decks that were played on the last episode of Game-Knights. We start with Kathleen De Vere's Slimefoot and Squee deck which is a Jund reanimator deck, where I have added a couple of infinite combo possibilities. I hope you enjoy this series!</p>\n", "video": "https://www.youtube.com/embed/8wHiSOEVT4k", "likes": 1, "author": "brazorobot"}, {"id": "10a2e0", "site": "magic", "title": "Jimmy's Deck is the Atraxa Killer??? BRILLIANT Tech!!!", "date": "2023-06-11", "image": null, "text": "<p>This is part 2 of my mini series dedicated to building the Game-Knights decks in Historic Brawl and it is time for Jimmy Wong's Goro-Goro and Satoru deck. This Commander is a 3 mana 3/4 goblin human that has: \"whenever one or more creatures you control that entered de battlefield this turn deal combat damage to a player, create a 5/5 dragon spirit token with flying\" and then, we can pay 2 to give haste to our creatures!</p>\n", "video": "https://www.youtube.com/embed/9RIOsqnZjAA", "likes": 1, "author": "brazorobot"}, {"id": "ab75fa", "site": "magic", "title": "A Better Colossal Dreadmaw in your Command Zone??? CRAZYNESS!!!", "date": "2023-06-11", "image": null, "text": "<p>Today is part 3 of my mini-series dedicated to playing with the commanders from the last episode of Game-Knights. This time it's the turn for Graham's Surrak and Goreclaw bear deck! This deck is janky but if you draw well enough it can become really really powerful.</p>\n", "video": "https://www.youtube.com/embed/_FWvK2daaP8", "likes": 1, "author": "brazorobot"}, {"id": "739c88", "site": "magic", "title": "WOOOOW!!! Is this the Best Reanimation Commander in the Format???", "date": "2023-06-11", "image": null, "text": "<p>Today we are playing with the last deck from last episode of Game-Knights. This is the deck that was played by Josh Lee-Kwai and it's Rona's dimir reanimator. The idea is to use her to loot, discarding our threats to the graveyard only to reanimate them and cheat big threats into play very early in the game. </p>\n", "video": "https://www.youtube.com/embed/TK3GozviXTo", "likes": 1, "author": "brazorobot"}, {"id": "bb408a", "site": "magic", "title": "1 Mana White Spells but each card GETS BETTER AND BETTER", "date": "2023-06-11", "image": null, "text": "<p>Today I'm doing a review of the best 1 mana value spells in white for the format. These are cards you have to consider when building your deck.</p>\n", "video": "https://www.youtube.com/embed/ZyAJ0VhIMyc", "likes": 1, "author": "brazorobot"}, {"id": "977d71", "site": "magic", "title": "Now THIS is a FUN card!!! 😂", "date": "2023-06-11", "image": "https://storage.googleapis.com/brazorobot/brazorobot_web/article_images/gollum.png", "text": "<p>OMG I want to play with this as my commander so bad!</p>\n\n<p>I think it is actually really good... 2 mana for a ~50% chance of drawing a card?</p>\n\n<p>It also won't die in combat easily... If opponent guesses right, it's removed from combat.</p>\n\n<p>If they guess wrong, it's unblockable.</p>\n\n<p>What an interesting and flavorful card!</p>\n\n<p>Please less Atraxas and more of THIS</p>\n", "video": null, "likes": 1, "author": "brazorobot"}, {"id": "f19bbf", "site": "magic", "title": "AI is getting crazier... Look at how it extends Magic art 😱", "date": "2023-06-11", "image": "https://storage.googleapis.com/brazorobot/brazorobot_web/article_images/vega.jpg", "text": "<p>AI for image generation is improving every day and now we can do things like <em>uncropping</em> images, which means an AI will extend your cropped images.  </p>\n\n<p>This is HUGE for Magic The Gathering card art, which are always constrained to the small rectangle.  </p>\n\n<p>In this case I tested one of these apps with a simple art like <strong>Vega, the Watcher</strong></p>\n\n<p>The result speaks for itself!</p>\n\n<p><img src=\"https://cards.scryfall.io/normal/front/2/8/28fced7f-3078-4a54-8f76-0ef14c732e97.jpg?1631051983\" alt=\"text\" /></p>\n", "video": null, "likes": 2, "author": "brazorobot"}, {"id": "841dec", "site": "magic", "title": "Time to learn a new Limited format!!!", "date": "2023-06-11", "image": null, "text": "<h2>Nicolai Bolas' draft guide to The Lord Of The Rings set</h2>\n\n<p>If you're a fan of Magic: The Gathering and the Lord of the Rings, then you're in for a treat! NicolaiBolas, a renowned MTG content creator, has recently released a comprehensive guide on how to succeed in the Lord of the Rings Draft. This guide is packed with valuable insights, from ranking the top commons for each color to providing an overview of every archetype. Let's dive into the key takeaways from this guide.</p>\n\n<h2>Set Mechanics</h2>\n\n<p>The Lord of the Rings Draft introduces two new mechanics: The Ring and Amass Orcs. The Ring mechanic tempts you with an emblem that gains abilities as the game progresses, while Amass Orcs allows you to build up an orc army by adding +1/+1 counters to an existing army or creating a new one if none exists.</p>\n\n<h2>Top Commons for Each Color</h2>\n\n<p>NicolaiBolas ranks the top commons for each color, providing insights into their strengths and how they can be utilized effectively. For instance, in white, Hobbit's Sting and Protector of Gondor are highly recommended, while in blue, Glorious Gale and Aphelian Kingfisher are top picks. In black, Claim the Precious and Dunland Cribane are favored, while red's top commons include Smite the Deathless and Rally the Hornberg. Lastly, in green, Many Partings and Generous Ent are considered the best.</p>\n\n<h2>Color Rankings</h2>\n\n<p>When it comes to color rankings, NicolaiBolas suggests using these as a tiebreaker for close picks. All colors are powerful, but it's best to find the open color and draft that deck. The color rankings are as follows: Blue, Green, White, Black, and Red.</p>\n\n<h2>Archetype Overviews</h2>\n\n<p>The guide provides an overview of each archetype, discussing their strengths and key cards. For instance, Red-White is a human token aggro deck that utilizes cards like Theoden, King of Rohan, and Erkenbrand. Blue-Black is an Amass control deck that leverages cards like The Mouth of Sauron and Gandalf, Friend of the Shire. Each color combination has its unique playstyle and strategy, and understanding these can give you an edge in the draft.</p>\n\n<h2>Combat Tricks and Traps</h2>\n\n<p>Being aware of the common combat tricks in each color can prevent you from getting blown out during games. For example, in white, watch out for Escape from Orthank and Second Breakfast, while in blue, Deceive the Messenger and Dreadful as the Storm are common tricks. NicolaiBolas also warns against certain trap cards like Ringside and Rising of the Day, which may seem good but often underperform.</p>\n\n<h2>Combos and Mana Fixing</h2>\n\n<p>The guide also highlights some powerful combos you can assemble with just commons and uncommons. For example, Erkenbrand, Lord of Westfold, and Rally at the Hornberg can lead to a massive attack, while Grishnakh, Brash Instigator, and Lash of the Balrog can eliminate your opponent's creatures. NicolaiBolas also discusses the mana fixing available at common in the set, such as Shire Terrace and Great Hall of the Citadel, which can help ensure you have the right mana to cast your spells.</p>\n\n<p>In conclusion, NicolaiBolas's Lord of the Rings Draft Guide is an invaluable resource for anyone looking to improve their draft skills and understanding of the game. Whether you're preparing for your first draft or looking to crush your competition, this guide has all the information you need. Remember to like, share, and subscribe to NicolaiBolas's channel for more MTG content.</p>\n\n<p>Happy drafting!!!</p>\n", "video": "https://www.youtube.com/embed/B3Ut4WCAbNk", "likes": 1, "author": "brazorobot"}, {"id": "d0a11a", "site": "magic", "title": "Waking up and watching Nummy play constructed??? 🥱☕", "date": "2023-06-12", "image": null, "text": "<p>My man NumotTheNummy playing mono green devotion in Explorer</p>\n", "video": "https://www.youtube.com/embed/k78jtyyqU_0", "likes": 0, "author": "brazorobot"}, {"id": "d2279e", "title": "Open Source LLM with Open Assistant!!!", "site": "ai", "date": "2023-06-12", "image": null, "text": "<p>Yannic Kilcher released a video titled \"<strong>OpenAssistant RELEASED! The world's best open-source Chat AI!</strong>\". The video announces the launch of OpenAssistant, an open-source AI assistant developed through a global community effort.</p>\n\n<p>OpenAssistant is the result of extensive work that began before Christmas. The team has built a data collection platform and gathered over <strong>600,000 interactions</strong> with humans, including 150,000 messages of human demonstrations of being an assistant. This has led to the creation of over 10,000 fully annotated conversation trees, covering a wide range of topics in numerous languages.</p>\n\n<p>The project has been supported by contributions from over <strong>13,000 volunteers</strong> worldwide. The team has trained models on this data, finding it to be unique and valuable. All the resources, including the dataset, code, chat interface, and a paper on the project, are open source and publicly available.</p>\n\n<p>The chat interface is the recommended platform for interacting with these models. The models, based on Llama and Pythia, are designed to fit into a single GPU. The Pythia-based models are fully open source and business-friendly. The team encourages users to contribute back to the project in any way they can.</p>\n\n<p>One of the highlighted features of OpenAssistant is its ability to interact with third-party systems. A user named Dragon demonstrated how the model can interact with Google to retrieve information dynamically.</p>\n\n<p>In conclusion, OpenAssistant represents a significant achievement in the field of open-source AI. It is a testament to the power of community collaboration and the potential of AI.</p>\n\n<h2>Relevant Links:</h2>\n\n<ul>\n<li><a href=\"https://open-assistant.io\">OpenAssistant</a></li>\n<li><a href=\"https://github.com/LAION-AI/Open-Assistant\">OpenAssistant's GitHub Repository</a></li>\n<li><a href=\"https://huggingface.co/datasets/OpenAssistant/oasst1\">OpenAssistant's Dataset on Hugging Face</a></li>\n<li><a href=\"https://ykilcher.com/oa-paper\">OpenAssistant's Paper</a></li>\n</ul>\n", "video": "https://www.youtube.com/embed/ddG2fM9i4Kk", "likes": 0, "author": "Gabriel Pierobon"}]